cf_billing/InformationRegisters/бестДоговорыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДоговорыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргЗоныОтвественности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргЗоныОтвественности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКассы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьДляОтправкиПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторAPIОплатыЛК</Name>
					<Comment>Содержит внешний ключ API оплаты для личного кабинета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/CommonForms/энргВыполнениеНачислений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПараметрыЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПараметрыЗаполнения);
		Если Параметры.ПараметрыЗаполнения.Свойство("ТолькоНП") И Параметры.ПараметрыЗаполнения.ТолькоНП Тогда
			СкрытьФизическиеЛица();
		КонецЕсли;
	Иначе
		Элементы.ГруппаОтборДоговор.Видимость		= Ложь;	
	КонецЕсли;
	СкрытьНезависимыйСбыт();
	
	энргФабрикаИнструментовНачисления.Инициализаровать();
	
	бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	бестЗащитаСерверПовтИсп.РаботаСПериодомДействияНП();
	бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиНП();
	бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиСобытияНП();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодНачисления 					= НачалоМесяца(ТекущаяДата()); 	
	ПредставлениеПериодаРегистрации 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисления);
	
	ЗаполнитьИменаМодулей();
	//ПериодНачисленияПо 					= НачалоМесяца(ТекущаяДата()); 	
	//ПредставлениеПериодаРегистрацииПо 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисленияПо);
		
	//Если НЕ ЗначениеЗаполнено(Район) Тогда
	//	ВыполнятьВФоне 							= истина;
	//КонецЕсли;
	СбрасыватьСостояниеПоследовательности 	= Истина;
	СтруктураОшибок 						= Новый Структура;
	ВыполнятьВФоне 							= Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	ОтборПоДому = ЗначениеЗаполнено(Дом);
КонецПроцедуры  

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормыВыбораПериода = Новый Структура("Значение, РежимВыбораПериода", ПериодНачисления, "МЕСЯЦ");
	ОткрытьФорму("ОбщаяФорма.энргВыборПериода",
	ПараметрыФормыВыбораПериода, 
	ЭтотОбъект, 
	ЭтотОбъект.УникальныйИдентификатор,,, 
	Оповещение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПредставлениеПериодаРегистрацииПоНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормыВыбораПериода = Новый Структура("Значение, РежимВыбораПериода", ПериодНачисленияПо, "МЕСЯЦ");
	ОткрытьФорму("ОбщаяФорма.энргВыборПериода",
	ПараметрыФормыВыбораПериода, 
	ЭтотОбъект, 
	ЭтотОбъект.УникальныйИдентификатор,,, 
	Оповещение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	энргОбщегоНазначенияКлиент.РегулированиеПредставленияПериодаРегистрации(Направление,
	СтандартнаяОбработка,
	ПериодНачисления,
	ПредставлениеПериодаРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПоРегулирование(Элемент, Направление, СтандартнаяОбработка)
	энргОбщегоНазначенияКлиент.РегулированиеПредставленияПериодаРегистрации(Направление,
	СтандартнаяОбработка,
	ПериодНачисленияПо,
	ПредставлениеПериодаРегистрацииПо);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПоОчистка(Элемент, СтандартнаяОбработка)
	ПериодНачисленияПо = '0001-01-01';
КонецПроцедуры 

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		ПериодНачисления = ВыбранныйПериод;
		ПредставлениеПериодаРегистрации = энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПоНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		ПериодНачисленияПо 					= ВыбранныйПериод;
		ПредставлениеПериодаРегистрацииПо 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисленияПо);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура  ОтменитьФоновоеЗаданиеСервер()
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(IDЗадания);
	
	Если Задание = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	СостояниеЗадания  		=  Задание.Состояние;
	
	Если СостояниеЗадания <> ПредопределенноеЗначение("СостояниеФоновогоЗадания.Активно") тогда
		Возврат;
	КонецЕсли;
	
	Задание.Отменить();
КонецПроцедуры

&НаКлиенте
Процедура СбрасыватьВзаиморасчетыПриИзменении(Элемент)
	
	Если СбрасыватьВзаиморасчеты Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, "Внимание: Установка данной галочи может значительно увеличить время восстановления последовательности взаиморасчетов!",РежимДиалогаВопрос.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СбрасыватьПоказанияПриИзменении(Элемент)
		
	Если СбрасыватьПоказания Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, "Внимание: Установка данной галочи может значительно увеличить время восстановления последовательности показаний!",РежимДиалогаВопрос.ОК);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьВсеОперации(Команда)
	ВыполняемыеОперации 						= Новый Структура;
	ПолучитьСписокОпераций(ВыполняемыеОперации);
	ДействияПередВыполнениемОперации(ВыполняемыеОперации, Неопределено, Истина);
	ПериодНачисленияТекущий 					= ПериодНачисления;
	
	Если Не ЗначениеЗаполнено(ПериодНачисленияПо) Тогда
		ПредставлениеТекущийПериодНачисления 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисленияТекущий);
		ЗапуститьВыполнениеОпераций(ВыполняемыеОперации);
		Возврат;
	КонецЕсли;  	
	
	ЕстьОшибки 									= Ложь;
	
	Пока ПериодНачисленияТекущий <= ПериодНачисленияПо Цикл		
		Если ЕстьОшибки Тогда
			Прервать;
		КонецЕсли;
		
		ПредставлениеТекущийПериодНачисления 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисленияТекущий);
		ЗапуститьВыполнениеОпераций(ВыполняемыеОперации);
		ПериодНачисленияТекущий 				= КонецМесяца(ПериодНачисленияТекущий) + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВсеОперацииПоНП(Команда)
	ВыполняемыеОперации 						= Новый Структура;
	ПолучитьСписокОпераций(ВыполняемыеОперации,,,Истина);
	ПериодНачисленияТекущий 					= ПериодНачисления;
	
	Если Не ЗначениеЗаполнено(ПериодНачисленияПо) Тогда
		ПредставлениеТекущийПериодНачисления 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисленияТекущий);
		ЗапуститьВыполнениеОпераций(ВыполняемыеОперации);
		Возврат;
	КонецЕсли;  	
	
	ЕстьОшибки 									= Ложь;
	
	Пока ПериодНачисленияТекущий <= ПериодНачисленияПо Цикл		
		Если ЕстьОшибки Тогда
			Прервать;
		КонецЕсли;
		
		ПредставлениеТекущийПериодНачисления 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисленияТекущий);
		ЗапуститьВыполнениеОпераций(ВыполняемыеОперации);
		ПериодНачисленияТекущий 				= КонецМесяца(ПериодНачисленияТекущий) + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультатВыполненияОпераций(Команда)
	
	Отборы = Новый Структура; 	
	ПараметрыПредзаполнения = Новый Структура;
	ПараметрыПредзаполнения.Вставить("ПериодНачисления", ПериодНачисления);
	ПараметрыПредзаполнения.Вставить("Организация", Организация);
	ПараметрыПредзаполнения.Вставить("Район", Район);
	Если ОтборПоДому Тогда
		
		Если ЗначениеЗаполнено(Дом) Тогда 
			ПараметрыПредзаполнения.Вставить("МКД", Дом);
		Иначе 
			ПараметрыПредзаполнения.Вставить("ЧастныйСектор", Истина);
		КонецЕсли;
		
	КонецЕсли;   	
	
	Отборы.Вставить("ПараметрыПредзаполнения", ПараметрыПредзаполнения);
	ОткрытьФорму(
		"Отчет.энргРезультатВыполненияОперацийНачислений.Форма.ФормаОтчета",
		Отборы,,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьФормыПоАбонентскомуОтделу(Команда)
			
	ЗаполнитьДанныеДляОткрытияНовыхФорм("Организация,ПериодНачисления,Филиал");	

КонецПроцедуры

&НаКлиенте
Процедура ПрерватьОперацию(Команда)
	ОтменитьФоновоеЗаданиеСервер();
	ПроверитьВыполнениеЗадания(); 	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗакрытиеПериода(Команда)
	
	ИмяМодуля 						= "энргНачисления.ОтменитьЗакрытьПериода";
	
	ПараметрыОпераций = Новый Структура;
	ПараметрыОпераций.Вставить("Организация",		Организация);
	ПараметрыОпераций.Вставить("ПериодНачисления",	ПериодНачисления);
	ПараметрыОпераций.Вставить("Район",				Район);
	
	Если ОтборПоДому тогда
		ПараметрыОпераций.Вставить("МКД",Дом);
	КонецЕсли;		
	
	Если ВыполнятьВФоне тогда	
		
		МассивПараметров = Новый Массив;
		для Каждого стр из ПараметрыОпераций цикл
			МассивПараметров.Добавить(стр.значение);
		КонецЦикла;	
		IDЗадания 			= ВыполнитьФоновоеЗадание(ИмяМодуля,МассивПараметров,"");
	иначе
		СтрокаМодуля 		= ИмяМодуля + "(";
		Счетчик 			= 0;
		для Каждого стр из ПараметрыОпераций цикл
			СтрокаМодуля 	= СтрокаМодуля +?(Счетчик= 0,"",",")+ "ПараметрыОпераций." + стр.ключ;
			Счетчик = Счетчик+1;
		КонецЦикла;
		СтрокаМодуля 		= СтрокаМодуля + ")";
		Попытка
			Выполнить (СтрокаМодуля);
		Исключение 			
			ОписаниеОшибки  = ИнформацияОбОшибке();
			//СлужебныеСообщения.ДобавитьСтроку(ОписаниеОшибки.Описание);
		КонецПопытки;
		УстановитьДоступностьЭлементовФормы(Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДругуюФорму(Команда)
	ОткрываемаяФорма  					= ПолучитьФорму("ОбщаяФорма.энргВыполнениеНачислений",,,Новый УникальныйИдентификатор);
	ОткрываемаяФорма.Организация  		= Организация;
	ОткрываемаяФорма.ПериодНачисления  	= ПериодНачисления;	
	ОткрываемаяФорма.ТекущийЭлемент  	= ОткрываемаяФорма.элементы.Район;
	ОткрываемаяФорма.открыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборАбонентскогоОтделаЗавершение(Значение, ДополнительныеПараметры) Экспорт  
	
	Если Значение  = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Районы 									= РайоныПоФилиалу(Значение); 
	
	Если Районы.Количество() > 0 Тогда
		 ЭтаФорма.Район 					= Районы[0];
	КонецЕсли;
	
	
	Для Сч = 1 По Районы.ВГраница() Цикл
		ОткрываемаяФорма  					= ПолучитьФорму("ОбщаяФорма.энргВыполнениеНачислений",,,Новый УникальныйИдентификатор);
		ОткрываемаяФорма.Организация  		= Организация;
		ОткрываемаяФорма.ПериодНачисления  	= ПериодНачисления;	
		ОткрываемаяФорма.Район			  	= Районы[Сч];
		ОткрываемаяФорма.открыть();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияЗавершение(Значение, ДополнительныеПараметры) Экспорт  
	
	Если Значение  = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеПараметры.Свойство("ИмяЭлемента") ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеПараметры.ИмяЭлемента) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[ДополнительныеПараметры.ИмяЭлемента] 	= Значение;
	
	ЗаполняемыПоля 									= ДополнительныеПараметры.ЗаполняемыПоля;
	Индекс 											= ДополнительныеПараметры.Индекс;
	Индекс 											= Индекс + 1;
	ВыбратьЗначениеПоля(ЗаполняемыПоля, Индекс);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РайоныПоФилиалу(Филиал)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.Текст 	=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргЗоныОтвественностиФилиалы.Ссылка КАК Район
	|ИЗ
	|	Справочник.энргЗоныОтвественности.Филиалы КАК энргЗоныОтвественностиФилиалы
	|ГДЕ
	|	энргЗоныОтвественностиФилиалы.Филиал = &Филиал";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Район");	
	
КонецФункции

&НаСервере
Процедура СкрытьФизическиеЛица()
	Элементы.ГруппаРегламетныеОперацииМКД.Видимость							= Ложь;
	Элементы.ГруппаРегламетныеОперацииИндивидуальные.Видимость				= Ложь;
	Элементы.ГруппаРассчетНачисленийМКД.Видимость							= Ложь;
	Элементы.ГруппаРассчетНачисленийФизическихЛиц.Видимость					= Ложь;
	Элементы.ГруппаРаспределениеНачисленногоМКДОбъема.Видимость				= Ложь;
	Элементы.ГруппаКорректировкаПотребленияСезонныхУслуг.Видимость			= Ложь;
	Элементы.ГруппаВосстановлениеПоследовательностиВзаиморасчетов.Видимость	= Ложь;
	Элементы.ГруппаНачислениеПени.Видимость									= Ложь;
	Элементы.ВыполнитьВсеОперации.Видимость									= Ложь;
	Элементы.ГруппаОтборДоговор.Видимость									= Истина;
КонецПроцедуры 

&НаСервере
Процедура СкрытьНезависимыйСбыт()
	НС = бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыполнитьВсеОперации", "Видимость", Не НС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРегламетныеОперацииМКД", "Видимость", Не НС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРегламетныеОперацииИндивидуальные", "Видимость", Не НС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРассчетНачисленийМКД", "Видимость", Не НС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРассчетНачисленийФизическихЛиц", "Видимость", Не НС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРаспределениеНачисленногоМКДОбъема", "Видимость", Не НС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКорректировкаПотребленияСезонныхУслуг", "Видимость", Не НС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВосстановлениеПоследовательностиВзаиморасчетов", "Видимость", Не НС);                   
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеДляОткрытияНовыхФорм(ЗаполняемыПоля)
	
	Поля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЗаполняемыПоля,",");
	Для Сч = 0 По Поля.ВГраница() Цикл
		ИмяПоля 	= Поля[Сч];
		Если ИмяПоля = "Филиал" Тогда
			ВыбратьЗначениеПоля(Поля, Сч);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма[ИмяПоля]) Тогда
			ВыбратьЗначениеПоля(Поля, Сч);
			Прервать;
		КонецЕсли;		 
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеПоля(ЗаполняемыПоля, Индекс)
	
	Если Индекс > ЗаполняемыПоля.ВГраница() Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗаполняемыПоля[Индекс] = "Организация" Тогда
		Оповещение = Новый ОписаниеОповещения("ВыборЗначенияЗавершение", ЭтаФорма,Новый Структура("ИмяЭлемента, ЗаполняемыПоля, Индекс","Организация", ЗаполняемыПоля, Индекс));
		ПоказатьВводЗначения(Оповещение,Неопределено,"Укажите организацию для выполнения начислений",Тип("СправочникСсылка.Организации"));
	КонецЕсли;
		
	Если ЗаполняемыПоля[Индекс] = "ПериодНачисления" Тогда
		Оповещение = Новый ОписаниеОповещения("ВыборЗначенияЗавершение", ЭтаФорма,Новый Структура("ИмяЭлемента, ЗаполняемыПоля, Индекс","Район", ЗаполняемыПоля, Индекс));
		ПоказатьВводДаты(Оповещение,'0001-01-01',"Укажите период начисления для выполнения начислений",ЧастиДаты.Дата);
	КонецЕсли;
	
	Если ЗаполняемыПоля[Индекс] = "Филиал" Тогда
		Оповещение = Новый ОписаниеОповещения("ВыборАбонентскогоОтделаЗавершение", ЭтаФорма,Новый Структура("ИмяЭлемента","Район"));
		ПоказатьВводЗначения(Оповещение,Неопределено,"Укажите абонентский",Тип("СправочникСсылка.энргФилиалы"));
	КонецЕсли;   	

КонецПроцедуры

&НаКлиенте
Функция ПараметрыОперацииПоЗаданию(ИмяЗадания,ТекРайон = Неопределено)
	
	ПараметрыОпераций   = Новый Структура;
	ПараметрыОпераций.Вставить("Организация",		Организация);
	ПараметрыОпераций.Вставить("ПериодНачисления",	ПериодНачисленияТекущий);
	Если ТекРайон <> Неопределено Тогда
		ПараметрыОпераций.Вставить("Район",				ТекРайон);
	Иначе 
		ПараметрыОпераций.Вставить("Район",				Район);
	КонецЕсли;
	
	Если ОтборПоДому И ЗначениеЗаполнено(Дом) Тогда
		ПараметрыОпераций.Вставить("ЧастныйСектор",		Ложь);
	ИначеЕсли ОтборПоДому Тогда
		ПараметрыОпераций.Вставить("ЧастныйСектор",		Истина);
	Иначе
		ПараметрыОпераций.Вставить("ЧастныйСектор",		Неопределено);
	КонецЕсли;
	
	//Если ИмяЗадания <> "ВосстановлениеПоследовательностиДокументовНП" тогда
		Если ОтборПоДому тогда
			ПараметрыОпераций.Вставить("МКД",Дом);
			ПараметрыОпераций.Вставить("МКД_НП",	?(ИсключаяОтдельностоящие, ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка"),Дом));
	
		иначе
			ПараметрыОпераций.Вставить("МКД",		Неопределено);
			ПараметрыОпераций.Вставить("МКД_НП",	Неопределено);
		КонецЕсли; 
	//КонецЕсли; 
	
	ПараметрыОпераций.Вставить("Строение",					Дом);
	ПараметрыОпераций.Вставить("Помещение",					Неопределено);
	ПараметрыОпераций.Вставить("Абонент",					Неопределено);
	ПараметрыОпераций.Вставить("СписокМКД",					Неопределено);
	ПараметрыОпераций.Вставить("ИсключаяОтдельностоящие",	ИсключаяОтдельностоящие);
	ПараметрыОпераций.Вставить("СбрасыватьВзаиморасчеты",	СбрасыватьВзаиморасчеты);
	ПараметрыОпераций.Вставить("СбрасыватьПоказания",		СбрасыватьПоказания);
	ПараметрыОпераций.Вставить("МассивКлючейПомещений",		Неопределено);
	ПараметрыОпераций.Вставить("МассивАбонентов",			Неопределено);
	ПараметрыОпераций.Вставить("ФинальноеНачисление",		Ложь);
	//Если ИмяЗадания = "ЗаполнениеНачальныхОстатков" тогда
		ПараметрыОпераций.Вставить("СбрасыватьСостояниеПоследовательности",СбрасыватьСостояниеПоследовательности);
	//КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ПараметрыОпераций.Вставить("мОбъектыРасчета",	ПолучитьМассивОбъектов(Организация, Район, ПериодНачисленияТекущий, Договор));
		ПараметрыОпераций.Вставить("Договор",			Договор);
	Иначе
		ПараметрыОпераций.Вставить("мОбъектыРасчета",	Неопределено);
		ПараметрыОпераций.Вставить("Договор",			Неопределено);
	КонецЕсли;
	
	Возврат ПараметрыОпераций;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивОбъектов(Организация, Район, Период, Договор)
	МассивОбъектов = Неопределено;
	РезультатЗапроса = РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(Организация, Район, Период, Договор);
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() <> 0 Тогда
		ТЗ.Свернуть("ОбъектРасчета");
		МассивОбъектов = ТЗ.ВыгрузитьКолонку("ОбъектРасчета");
	КонецЕсли;
	Возврат МассивОбъектов;
КонецФункции

&НаКлиенте
Процедура УстановитьКартинки()
	Операции 				= Операции();
	Для Каждого Операция Из Операции Цикл
		Элемент 			= Элементы["Статус" + Операция.Значение];
		Элемент.Картинка 	= БиблиотекаКартинок.ВосклицательныйЗнакСерый;
	КонецЦикла; 
				
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы(Значение) 
	
	Элементы.ВыполнитьВсеОперации.Доступность 												= Значение;
	Элементы.ОтменитьЗакрытиеПериода.Доступность											= Значение;
	Элементы.ВыполнитьВсеОперацииПоНП.Доступность											= Значение;	
	
	Элементы.ПредставлениеПериодаРегистрации.Доступность									= Значение;
	Элементы.Организация.Доступность														= Значение;	
	Элементы.Район.Доступность 																= Значение;
	Элементы.Дом.Доступность 																= Значение;
	Элементы.ОтборПоДому.Доступность 														= Значение;  
	Элементы.ВыполнятьВФоне.Доступность 													= Значение;
	
	Элементы.ДекорацияЗаполнениеНачальныхОстатков.Доступность 								= Значение;
	Элементы.ДекорацияВосстановлениеПоследовательностиДокументов.Доступность 				= Значение;
	Элементы.ДекорацияВосстановлениеПоследовательностиПоказанийПУ.Доступность 				= Значение;
	
	Элементы.ДекорацияИндивидуальныеНачисления.Доступность 									= Значение;
	Элементы.ДекорацияПерерасчетСреднихНачислений.Доступность 								= Значение;
	Элементы.ГруппаУстановкаЗначенийДифференцированныхТарифов.Доступность 					= Значение;
	Элементы.ДекорацияРаспределениеОбъемаМКД.Доступность 									= Значение;
	Элементы.ДекорацияНачислениеПроцентовРассрочки.Доступность 								= Значение;	
	
	Элементы.ДекорацияРасчетЛьгот.Доступность 												= Значение;
	Элементы.ДекорацияКорректировкаПотребленияСезонныхУслуг.Доступность 					= Значение;	
	
	Элементы.ДекорацияЗаполнениеНачальныхОстатковНП.Доступность 							= Значение;
	Элементы.ДекорацияВосстановлениеПоследовательностиДокументовНП.Доступность 				= Значение;
	Элементы.ДекорацияВосстановлениеПоследовательностиПоказанийПУНП.Доступность 			= Значение;
	
	Элементы.ДекорацияКорректировкаПотребленияСезонныхУслугМКД.Доступность 					= Значение;
	Элементы.ДекорацияПерерасчетПриУстановкеПрибораУчетаСезонныхУслуг.Доступность 			= Значение;
		
	Элементы.ДекорацияЗаполнениеНачальныхОстатковМКД.Доступность 							= Значение;
	Элементы.ДекорацияВосстановлениеПоследовательностиДокументовМКД.Доступность				= Значение;
	Элементы.ДекорацияВосстановлениеПоследовательностиПоказанийМКД.Доступность 				= Значение;
	Элементы.ДекорацияВосстановлениеПоследовательностиВзаиморасчетов.Доступность 			= Значение;
	Элементы.ДекорацияНачислениеПени.Доступность 											= Значение;
	Элементы.ДекорацияЗакрытиеПериодаНачисления.Доступность 								= Значение;
	
	Элементы.ДекорацияПерерасчетСреднихНачисленийМКД.Доступность 							= Значение;
	Элементы.ДекорацияРасчетНачисленийНаМКД.Доступность 									= Значение;
	Элементы.ДекорацияПерерасчетСреднихНачисленийНП.Доступность 							= Значение;
	Элементы.ДекорацияИндивидуальныеНачисленияНП.Доступность 								= Значение;
	Элементы.ДекорацияНачисленияПоДолевымСхемам.Доступность 								= Значение;
	Элементы.ДекорацияВосстановлениеПоследовательностиВзаиморасчетовНП.Доступность 			= Значение;
	Элементы.ДекорацияНачисленияПоСхемамСтруктурыСети.Доступность 							= Значение;
	Элементы.ДекорацияДополнительныеНачисленияЮЛ.Доступность 								= Значение;


	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьВыполняемоеДействие(Элемент)
	ИмяОперации 		= СтрЗаменить(Элемент.Имя,"Декорация","");
	ОднаСтрокаМеню 		= Ложь;
	Операции 			= Операции();
	Для Каждого КлючЗначение Из Операции Цикл
		Если НЕ ИмяОперации = КлючЗначение.Значение Тогда
			Продолжить;
		КонецЕсли;
		
		Индекс  		= Число(СтрЗаменить(КлючЗначение.Ключ,"Операция",""));
		ОднаСтрокаМеню 	= Индекс = 0;		
	КонецЦикла;	
	
	МассивОпераций  	= Новый Массив;
	МассивОпераций.Добавить("Выполнить операцию");
	Если не ОднаСтрокаМеню тогда
		МассивОпераций.Добавить("Выполнить все до текущей операции");
		МассивОпераций.Добавить("Выполнить начиная с этой операции");
	КонецЕсли;
	Список  = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(МассивОпераций);
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВыборИзМенюЗавершение",ЭтотОбъект,Новый Структура("ИмяОперации",ИмяОперации));
	ПоказатьВыборИзМеню(ОписаниеОповещения,Список,Элемент);	
КонецФункции

&НаКлиенте
Процедура ВыборИзМенюЗавершение(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт 	
	
	Если ВыбранныйЭлемент = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Значение  				= ВыбранныйЭлемент.значение;
	Предыдущие 				= Неопределено;
	Если Значение = "Выполнить все до текущей операции" тогда 	 
		Предыдущие 			= истина;
	ИначеЕсли Значение = "Выполнить начиная с этой операции" тогда
		Предыдущие 			= ложь;
	КонецЕсли; 	
	
	ПериодНачисленияТекущий = ПериодНачисления;
	ВыполняемыеОперации 	= Новый Структура;
	ПолучитьСписокОпераций(ВыполняемыеОперации,ДополнительныеПараметры.ИмяОперации,Предыдущие);
	
	ДействияПередВыполнениемОперации(ВыполняемыеОперации, ДополнительныеПараметры, Предыдущие);
	
	Если Не ЗначениеЗаполнено(ПериодНачисленияПо) Тогда
		ПредставлениеТекущийПериодНачисления 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисленияТекущий);
		ЗапуститьВыполнениеОпераций(ВыполняемыеОперации);
		Возврат;
	КонецЕсли;  	
	
	ЕстьОшибки	= Ложь;
	
	Пока ПериодНачисленияТекущий <= ПериодНачисленияПо Цикл		
		Если ЕстьОшибки Тогда
			Прервать;
		КонецЕсли;
		ПредставлениеТекущийПериодНачисления 	= энргОбщегоНазначенияКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодНачисленияТекущий);
		ЗапуститьВыполнениеОпераций(ВыполняемыеОперации);
		ПериодНачисленияТекущий	= КонецМесяца(ПериодНачисленияТекущий) + 1;
	КонецЦикла;   
КонецПроцедуры

&НаКлиенте
Процедура ДействияПередВыполнениемОперации(ВыполняемыеОперации, ДополнительныеПараметры, Предыдущие)
	// переопределено в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокОпераций(ВыполняемыеОперации,ИмяОперации=Неопределено,ВыполнятьПредыдущие=Неопределено,ТолькоОперацииНП = Ложь)
	
	Операции = Операции(ТолькоОперацииНП);
	
	Если ИмяОперации =Неопределено тогда // выполнение всех операций
		для Каждого стр из Операции цикл
			ВыполняемыеОперации.вставить(стр.ключ,стр.Значение);
		КонецЦикла;
		Возврат ;
	иначе
		
	КонецЕсли;
	
	для Каждого стр из Операции цикл
		Если стр.Значение = ИмяОперации тогда
			ИндексОперации  = Число(СтрЗаменить(стр.Ключ,"Операция",""));
		КонецЕсли; 		
	КонецЦикла;
	
	Если ВыполнятьПредыдущие = Неопределено тогда
		// выполняем только одну операцию		
		ВыполняемыеОперации.вставить("Операция" + 0,Операции["Операция" + ИндексОперации]);
		Возврат;
	КонецЕсли;	
	
	Если ВыполнятьПредыдущие тогда
		для Строка = 0 по ИндексОперации-1 цикл
			ВыполняемыеОперации.вставить("Операция" + Строка,Операции["Операция" + Строка]);
		КонецЦикла; 		
	иначе
		Счетчик  = 0;
		для Строка = ИндексОперации по Операции.Количество() - 1 цикл
			ВыполняемыеОперации.вставить("Операция" + Счетчик,Операции["Операция" + Строка]);
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВыполнениеОпераций(ВыполняемыеОперации)
	ПараметрыОпераций   = Новый Структура;
	ПараметрыОпераций.Вставить("Организация",		Организация);
	ПараметрыОпераций.Вставить("ПериодНачисления",	ПериодНачисленияТекущий);
	ПараметрыОпераций.Вставить("Район",				Район);
	Если ОтборПоДому тогда
		ПараметрыОпераций.Вставить("Дом",Дом);
	КонецЕсли; 
	
	Если НЕ ВсеПоляЗаполнены() Тогда
		Возврат;
	КонецЕсли; 	
	
	УстановитьКартинки();
	
	УстановитьДоступностьЭлементовФормы(Ложь);
	
	ИндексТекОперации = 0;
	Если Не ВыполнятьВФоне тогда
		//СлужебныеСообщения.Очистить();
		для Каждого стр из ВыполняемыеОперации цикл
			ВыполнитьОперацию(ВыполняемыеОперации["Операция" + ИндексТекОперации]);
		КонецЦикла;		
	иначе
		//ВыполнитьОперацию(ВыполняемыеОперации["Операция" + ИндексТекОперации]); было
		ЗапуститьФоновыеВыполнениеОпераций(ВыполняемыеОперации); //стало
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеЗадания()
	
	СтруктураСостояниеЗаданий	=  ВернутьСтруктуруЗадания();
	
	ЭлементКартинка  			= Элементы["Статус" + ВыполняемыеОперации["Операция" + ИндексТекОперации]];
	ЭлементОшибок 				= Элементы["Ошибки" + ВыполняемыеОперации["Операция" + ИндексТекОперации]];
	
	Ошибки 						= СтруктураСостояниеЗаданий.Ошибки;
	ЕСли Ошибки<>Неопределено тогда
		
		ОписаниеОшибки 				= Новый Структура;
		ОписаниеОшибки.Вставить("ПериодНачисления", ПериодНачисления);
		ОписаниеОшибки.Вставить("Ораганизация", 	Организация);
		ОписаниеОшибки.Вставить("Район",			Район);
		ОписаниеОшибки.Вставить("МКД",				Дом);
		ОписаниеОшибки.Вставить("ОтборПоМКД",		ОтборПоДому);
		ОписаниеОшибки.Вставить("Ошибки",			Ошибки);			
		Если  Ошибки.Количество()> 0 тогда
			ЭлементОшибок.Доступность 	= истина;
			ЭлементОшибок.Заголовок 	= "Ошибок ("+Ошибки.Количество() +")"; 						
			СтруктураОшибок.вставить(ВыполняемыеОперации["Операция" + ИндексТекОперации],ОписаниеОшибки);
		КонецЕсли;  
	КонецЕсли;
	
	Если 		СтруктураСостояниеЗаданий.Активно 			тогда
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания",10,Истина);
		// ничего не делаем 					
	ИначеЕсли 	СтруктураСостояниеЗаданий.Завершено 			тогда
		
		// устанавливаем картинку удачного завершения задания 		
		ЭлементКартинка.картинка  	= БиблиотекаКартинок.Успешно32;					
		
		// если есть запускаем следующее задание
		ИндексТекОперации  =ИндексТекОперации + 1;
		Если ВыполняемыеОперации.количество() - 1 >= ИндексТекОперации тогда
			ВыполнитьОперацию(ВыполняемыеОперации["Операция" + ИндексТекОперации]);
		иначе
			// отжимаем гиперссылку
			УстановитьДоступностьЭлементовФормы(Истина);
		КонецЕсли;
		
	ИначеЕсли 	СтруктураСостояниеЗаданий.ЗавершеноАварийно 	тогда
		
		// устанавливаем картинку не удачного завершения
		ЭлементКартинка.картинка  	= БиблиотекаКартинок.Ошибка32;
		
		// отжимаем гиперссылку
		УстановитьДоступностьЭлементовФормы(Истина);						
		
	ИначеЕсли СтруктураСостояниеЗаданий.Отменено тогда
		
		// устанавливаем картинку не удачного завершения
		ЭлементКартинка.картинка  	= БиблиотекаКартинок.Ошибка32;
		
		// отжимаем гиперссылку
		УстановитьДоступностьЭлементовФормы(Истина);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВернутьСтруктуруЗадания()
	Задание 												= ФоновыеЗадания.НайтиПоУникальномуИдентификатору(IDЗадания);
	СтруктураСостояниеЗаданий								= Новый Структура;
	СостояниеЗадания										= Задание.Состояние;
	СтруктураСостояниеЗаданий.Вставить("Активно", 			СостояниеЗадания = ПредопределенноеЗначение("СостояниеФоновогоЗадания.Активно"));
	СтруктураСостояниеЗаданий.Вставить("Завершено", 		СостояниеЗадания = ПредопределенноеЗначение("СостояниеФоновогоЗадания.Завершено"));
	СтруктураСостояниеЗаданий.Вставить("ЗавершеноАварийно", СостояниеЗадания = ПредопределенноеЗначение("СостояниеФоновогоЗадания.ЗавершеноАварийно"));
	СтруктураСостояниеЗаданий.Вставить("Отменено", 			СостояниеЗадания = ПредопределенноеЗначение("СостояниеФоновогоЗадания.Отменено"));
	СтруктураСостояниеЗаданий.Вставить("Ошибки",			Задание.ПолучитьСообщенияПользователю());
	Если НЕ Задание.ИнформацияОбОшибке						= Неопределено Тогда 
		//СлужебныеСообщения.ДобавитьСтроку(Задание.ИнформацияОбОшибке.Описание);
	КонецЕсли;
	
	Возврат СтруктураСостояниеЗаданий;
КонецФункции

&НаКлиенте
Процедура ВыполнитьОперацию(ИмяОперации,ТекРайон = Неопределено)
	
	ИмяМодуля 								= ИменаМодулей[ИмяОперации];
	
	ПараметрыОпераций 						= ПараметрыОперацииПоЗаданию(ИмяОперации,ТекРайон);

	
	Если ВыполнятьВФоне тогда			
		
		МассивПараметров 					= Новый Массив;
		для Каждого стр из ПараметрыОпераций цикл
			МассивПараметров.Добавить(стр.значение);
		КонецЦикла;	
		ПредставлениеОперации  				= ИмяОперации + " по району " + ПараметрыОпераций.Район + "за период: " + ПараметрыОпераций.периодНачисления + "";  
		
		Если ПараметрыОпераций.свойство("Дом") тогда
			ПредставлениеОперации 			= ПредставлениеОперации + " отбор по дому: " + ПараметрыОпераций.Дом;
		КонецЕсли;
		
		СвойстваЗадания  					= ВыполнитьФоновоеЗадание(ИмяМодуля,МассивПараметров,ПредставлениеОперации);
		
		IDЗадания 							= СвойстваЗадания.УникальныйИдентификатор;
		ЭлементКартинка  					= Элементы["Статус" + ИмяОперации];
		ЭлементКартинка.картинка  			= БиблиотекаКартинок.ДлительнаяОперация48;
		
		ЭлементОшибок 						= Элементы["Ошибки" + ВыполняемыеОперации["Операция" + ИндексТекОперации]];
		ЭлементОшибок.Заголовок 			= "Нет Ошибок";
		
		Если СтруктураОшибок.свойство(ИмяОперации) тогда
			СтруктураОшибок[ИмяОперации] 	= Новый Массив;
		КонецЕсли;			
		
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания",2,Истина);
		
	иначе
		СтрокаМодуля 						= ИмяМодуля + "(";
		Счетчик 							= 0;
		для Каждого стр из ПараметрыОпераций цикл
			СтрокаМодуля 					= СтрокаМодуля +?(Счетчик= 0,"",",")+ "ПараметрыОпераций." + стр.ключ;
			Счетчик 						= Счетчик+1;
		КонецЦикла;
		СтрокаМодуля 						= СтрокаМодуля + ")";
		
		ЭлементКартинка  					= Элементы["Статус" + ИмяОперации];
		
		ЭлементОшибок 						= Элементы["Ошибки" + ВыполняемыеОперации["Операция" + ИндексТекОперации]];
		ЭлементОшибок.Заголовок 			= "Нет Ошибок";
		
		Попытка
			Если ИмяОперации = "ЗаполнениеНачальныхОстатковМКД" Тогда
				энргРаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисленияМКД(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиДокументовМКД" Тогда
				энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериодыМКД(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиПоказанийМКД" Тогда
				энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУМКД(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ЗаполнениеНачальныхОстатков" Тогда
				энргРаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисления(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиДокументов" Тогда
				энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериоды(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиПоказанийПУ" Тогда  
				
				Если СбрасыватьПоказания Тогда
					 СброситьПоследовательностьПоказанийНаСервере(ПараметрыОпераций);
				КонецЕсли;
				
				энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУ(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ПерерасчетСреднихНачисленийМКД" Тогда
				энргНачисления.СнятьСредниеНачисленияМКД(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "РасчетНачисленийНаМКД" Тогда
				энргНачисления.НачислениеНаОДН(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ПерерасчетСреднихНачислений" Тогда
				энргНачисления.СнятьСредниеНачисления(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "УстановкаЗначенийДифференцированныхТарифов" Тогда
				энргНачисления.УстановитьЗначенияДифференцированныхТарифов(ПараметрыОпераций);	
			ИначеЕсли ИмяОперации = "ИндивидуальныеНачисления" Тогда
				энргНачисления.Начислить(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "РаспределениеОбъемаМКД" Тогда
				энргНачисления.РаспредениеОбъемаМКД(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "НачислениеПроцентовРассрочки" Тогда
				энргНачисления.НачислениеПоРассрочке(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ПерерасчетПриУстановкеПрибораУчетаСезонныхУслуг" Тогда
				энргНачисления.ИзменитьПризнакСостояниеПрибора(ПараметрыОпераций);				
			ИначеЕсли ИмяОперации = "КорректировкаПотребленияСезонныхУслуг" Тогда
				энргНачисления.СкорректироватьПотреблениеСезонныхУслуг(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "КорректировкаПотребленияСезонныхУслугМКД" Тогда
				энргНачисления.СкорректироватьПотреблениеСезонныхУслугМКД(ПараметрыОпераций);	
			ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиВзаиморасчетов" Тогда
				
				Если СбрасыватьВзаиморасчеты Тогда
					 СброситьВзаиморасчетыНаСервере(ПараметрыОпераций);
				КонецЕсли;
				
				энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "НачислениеПени" Тогда
				энргНачисления.НачислитьПеню(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ЗакрытиеПериодаНачисления" Тогда
				энргНачисления.ЗакрытьПериодДляРедактирования(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ЗаполнениеНачальныхОстатковНП" Тогда
				бестРаботаСПоследовательностямиНП.ОтложенныеДвиженияДокументовНачисленияНП(ПараметрыОпераций, ПараметрыОпераций.мОбъектыРасчета);
			ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиДокументовНП" Тогда
				бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьСтабильныеПериодыНП(ПараметрыОпераций, ПараметрыОпераций.мОбъектыРасчета);
			ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиПоказанийПУНП" Тогда
				бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоказанияПУНП(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "ИндивидуальныеНачисленияНП" Тогда
				бестНачисленияНП.Начислить(ПараметрыОпераций, ПараметрыОпераций.мОбъектыРасчета);
			ИначеЕсли ИмяОперации = "РасчетЛьгот" Тогда
				энргНачисления.НачислитьЛьготы(ПараметрыОпераций);
			ИначеЕсли ИмяОперации = "НачисленияПоДолевымСхемам" Тогда
				бестНачисленияНП.НачисленияПоДолевымСхемам(ПараметрыОпераций);	
			ИначеЕсли ИмяОперации = "НачислениеПоДСИзРазныхРО" Тогда
				бестНачисленияНП.НачисленияПоДолевымСхемам(ПараметрыОпераций,,, Истина);
			ИначеЕсли ИмяОперации = "ПерерасчетСреднихНачисленийНП" Тогда
				бестНачисленияНП.СнятьСредниеНачисленияНП(ПараметрыОпераций, ПараметрыОпераций.Договор);
			ИначеЕсли ИмяОперации = "НачисленияПоСхемамСтруктурыСети" Тогда
				бестНачисленияНП.НачисленияПоСхемамСтруктурыСети(ПараметрыОпераций, ПараметрыОпераций.Договор);	
			ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиВзаиморасчетовНП" Тогда
				бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьВзаиморасчетыНП(ПараметрыОпераций, ПараметрыОпераций.Договор);
			ИначеЕсли ИмяОперации = "ДополнительныеНачисленияЮЛ" Тогда
				бестНачисленияНП.ДополнительныеНачисленияЮЛ(ПараметрыОпераций, ПараметрыОпераций.Договор);	
			Иначе
				Выполнить (СтрокаМодуля);
			КонецЕсли;
			ИндексТекОперации 				= ИндексТекОперации + 1;
			ЭлементКартинка.картинка  		= БиблиотекаКартинок.Успешно32;
			ЭлементОшибок.Заголовок 		= "Нет Ошибок";
			ЭлементОшибок.Доступность 		= Ложь;
		Исключение
			ЕстьОшибки 						= Истина;
			ИндексТекОперации 				= ИндексТекОперации + 1;
			ЭлементОшибок.Заголовок 		= "Есть ошибки";
			ЭлементКартинка.картинка  		= БиблиотекаКартинок.Ошибка32;
			ЭлементОшибок.Доступность 		= Истина;
			ОписаниеОшибки  				= ИнформацияОбОшибке();
			Ошибки 							= Новый Массив;
			Ошибки.Добавить(Новый Структура("Текст", ОписаниеОшибки.Описание + Символы.ПС + КраткоеПредставлениеОшибки(ОписаниеОшибки)));
			
			ОписаниеОшибки 					= Новый Структура;
			ОписаниеОшибки.Вставить("ПериодНачисления", ПериодНачисления);
			ОписаниеОшибки.Вставить("Ораганизация", 	Организация);
			ОписаниеОшибки.Вставить("Район",			Район);
			ОписаниеОшибки.Вставить("МКД",				Дом);
			ОписаниеОшибки.Вставить("ОтборПоМКД",		ОтборПоДому);
			ОписаниеОшибки.Вставить("Ошибки",			Ошибки);
			
			СтруктураОшибок.Вставить(ИмяОперации, ОписаниеОшибки);			
		КонецПопытки;
		УстановитьДоступностьЭлементовФормы(Истина);
	КонецЕсли;	 	
КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗадание(ИмяМодуля,МассивПараметров,ПредставлениеОперации)
	Задание 					= ФоновыеЗадания.Выполнить(ИмяМодуля, МассивПараметров,,ПредставлениеОперации);
	ЗаданиеВыполнено  			= Ложь;
	
	Возврат Новый Структура("УникальныйИдентификатор,ЗаданиеВыполнено",Задание.УникальныйИдентификатор,ЗаданиеВыполнено);
КонецФункции

&НаКлиенте
Процедура ПоказатьОшибкиПользователю(Элемент)
	
	ИмяОперации 								= СтрЗаменить(Элемент.Имя,"Ошибки","");
		
	Если ИмяОперации = "" тогда
		Возврат;
	КонецЕсли; 	
	
	ОчиститьСообщения();
	ОписаниеОшибки								= СтруктураОшибок[ИмяОперации];
	ЕстьОшибки  								= ОписаниеОшибки.Ошибки.Количество() > 0;
	
	Если ЕстьОшибки тогда
		ОткрытьФорму("ОбщаяФорма.энргОписаниеОшибкиВыполненияНачислений",Новый Структура("ИмяОперации, ОписаниеОшибки", ИмяОперации, ОписаниеОшибки),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Функция ВсеПоляЗаполнены()
	Отказ 									= Ложь;	
	Если Не ПараметрыОпераций.Свойство("Организация") ИЛИ Не ЗначениеЗаполнено(ПараметрыОпераций.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите организацию", ,"Организация");
		Отказ 								= Истина;
	КонецЕсли;
	
	Если Не ПараметрыОпераций.Свойство("ПериодНачисления") ИЛИ Не ЗначениеЗаполнено(ПараметрыОпераций.ПериодНачисления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите период начисления", ,"ПредставлениеПериодаРегистрации");
		Отказ 								= Истина;
	КонецЕсли;
	
	Если Не ПараметрыОпераций.Свойство("Район") ИЛИ Не ЗначениеЗаполнено(ПараметрыОпераций.Район) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите район", ,"Район");
		Отказ 								= Истина;
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции      

&НаКлиенте
Функция Операции(ТолькоОперацииНП = Ложь)
	
	Операции 	= Новый Структура;
	
	мОперации 	= Новый Массив;
	
	#Область РегламетныеОперации
	
	#Область МногоквартирныеДома
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("ЗаполнениеНачальныхОстатковМКД");
		мОперации.Добавить("ВосстановлениеПоследовательностиДокументовМКД");
		мОперации.Добавить("ВосстановлениеПоследовательностиПоказанийМКД");
	КонецЕсли;
	#КонецОбласти
	
	#Область ФизическиеЛица
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("ЗаполнениеНачальныхОстатков");
		мОперации.Добавить("ВосстановлениеПоследовательностиДокументов");
		мОперации.Добавить("ВосстановлениеПоследовательностиПоказанийПУ");
	КонецЕсли;
	#КонецОбласти
	
	#Область НежилыеПомещения
	мОперации.Добавить("ЗаполнениеНачальныхОстатковНП");
	мОперации.Добавить("ВосстановлениеПоследовательностиДокументовНП"); 
	мОперации.Добавить("ВосстановлениеПоследовательностиПоказанийПУНП");
	#КонецОбласти
	
	#КонецОбласти
	
	#Область РассчетНачислений
	
	#Область МногоквартирныеДома
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("РасчетНачисленийНаМКД");
		мОперации.Добавить("ПерерасчетСреднихНачисленийМКД");
		мОперации.Добавить("КорректировкаПотребленияСезонныхУслугМКД");
	КонецЕсли;
	#КонецОбласти
	
	#Область ФизическиеЛица
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("ИндивидуальныеНачисления");	
		мОперации.Добавить("ПерерасчетСреднихНачислений");
		мОперации.Добавить("УстановкаЗначенийДифференцированныхТарифов");
		мОперации.Добавить("ПерерасчетПриУстановкеПрибораУчетаСезонныхУслуг");
		мОперации.Добавить("НачислениеПроцентовРассрочки");
		мОперации.Добавить("РасчетЛьгот");
	КонецЕсли;
	#КонецОбласти
	
	#Область НежилыеПомещения
	мОперации.Добавить("ИндивидуальныеНачисленияНП");
	мОперации.Добавить("НачисленияПоДолевымСхемам");
	мОперации.Добавить("НачислениеПоДСИзРазныхРО");
	мОперации.Добавить("ПерерасчетСреднихНачисленийНП");
	#КонецОбласти
	
	#КонецОбласти
	
	#Область РаспределениеИКорректировка
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("РаспределениеОбъемаМКД");
		мОперации.Добавить("КорректировкаПотребленияСезонныхУслуг");
		мОперации.Добавить("ВосстановлениеПоследовательностиВзаиморасчетов");
		мОперации.Добавить("НачислениеПени");
		
	КонецЕсли;
	мОперации.Добавить("НачисленияПоСхемамСтруктурыСети");
	мОперации.Добавить("ДополнительныеНачисленияЮЛ");
	мОперации.Добавить("ВосстановлениеПоследовательностиВзаиморасчетовНП");
	#КонецОбласти
	
	#Область ПрочииОперации
	мОперации.Добавить("ЗакрытиеПериодаНачисления");
	#КонецОбласти 	
	
	Для Сч = 0 По мОперации.ВГраница() Цикл
		Операции.Вставить("Операция" + Формат("" + Сч,"ЧРГ=' '; ЧГ=0"),мОперации[Сч]);
	КонецЦикла; 	
	
	Возврат Операции;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИменаМодулей()
	
	ИменаМодулей = Новый Структура;
	ИменаМодулей.Вставить("ЗаполнениеНачальныхОстатков",								"энргРаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисления");
	ИменаМодулей.Вставить("ЗаполнениеНачальныхОстатковМКД",								"энргРаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисленияМКД");
	ИменаМодулей.Вставить("ЗаполнениеНачальныхОстатковНП",								"бестРаботаСПоследовательностямиНП.ОтложенныеДвиженияДокументовНачисленияНП");
	
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиДокументов",					"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериоды");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиДокументовМКД",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериодыМКД");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиДокументовНП",				"бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьСтабильныеПериодыНП");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиПоказанийПУ",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУ");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиПоказанийМКД",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУМКД");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиПоказанийПУНП",				"бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоказанияПУНП");
	ИменаМодулей.Вставить("ИндивидуальныеНачисления",									"энргНачисления.Начислить");
	ИменаМодулей.Вставить("ИндивидуальныеНачисленияНП",									"бестНачисленияНП.Начислить");
	ИменаМодулей.Вставить("ПерерасчетСреднихНачислений",								"энргНачисления.СнятьСредниеНачисления");
	ИменаМодулей.Вставить("УстановкаЗначенийДифференцированныхТарифов",					"энргНачисления.УстановитьЗначенияДифференцированныхТарифов");
	ИменаМодулей.Вставить("ПерерасчетПриУстановкеПрибораУчетаСезонныхУслуг",			"энргНачисления.ИзменитьПризнакСостояниеПрибора");
	ИменаМодулей.Вставить("ПерерасчетСреднихНачисленийМКД",								"энргНачисления.СнятьСредниеНачисленияМКД");	
	ИменаМодулей.Вставить("РасчетНачисленийНаМКД",										"энргНачисления.НачислениеНаОДН");
	ИменаМодулей.Вставить("РаспределениеОбъемаМКД",										"энргНачисления.РаспредениеОбъемаМКД");
	ИменаМодулей.Вставить("НачислениеПроцентовРассрочки",								"энргНачисления.НачислениеПоРассрочке");
	ИменаМодулей.Вставить("КорректировкаПотребленияСезонныхУслуг",						"энргНачисления.СкорректироватьПотреблениеСезонныхУслуг");
	ИменаМодулей.Вставить("КорректировкаПотребленияСезонныхУслугМКД",					"энргНачисления.СкорректироватьПотреблениеСезонныхУслугМКД");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиВзаиморасчетов",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты");
	ИменаМодулей.Вставить("НачислениеПени",												"энргНачисления.НачислитьПеню");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиВзаиморасчетов",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты");
	ИменаМодулей.Вставить("ЗакрытиеПериодаНачисления",									"энргНачисления.ЗакрытьПериодДляРедактирования");
	ИменаМодулей.Вставить("РасчетЛьгот",												"энргНачисления.НачислитьЛьготы");
	ИменаМодулей.Вставить("НачисленияПоДолевымСхемам",   								"бестНачисленияНП.НачисленияПоДолевымСхемам"); 
	ИменаМодулей.Вставить("НачислениеПоДСИзРазныхРО",   								"бестНачисленияНП.НачисленияПоДолевымСхемам");
	ИменаМодулей.Вставить("ПерерасчетСреднихНачисленийНП",								"бестНачисленияНП.СнятьСредниеНачисленияНП");
	ИменаМодулей.Вставить("НачисленияПоСхемамСтруктурыСети",							"бестНачисленияНП.НачисленияПоСхемамСтруктурыСети");
	ИменаМодулей.Вставить("ДополнительныеНачисленияЮЛ",									"бестНачисленияНП.ДополнительныеНачисленияЮЛ");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиВзаиморасчетовНП",			"бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьВзаиморасчетыНП");
	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СброситьВзаиморасчетыНаСервере(ПараметрыОпераций)
	
	энргВыполнениеНачислений.СброситьВзаиморасчеты(ПараметрыОпераций);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СброситьПоследовательностьПоказанийНаСервере(ПараметрыОпераций)
	
	энргВыполнениеНачислений.СброситьПоследовательностьПоказаний(ПараметрыОпераций);
	
КонецПроцедуры

#Область ФоновоеВыполнениеЗадачи

&НаКлиенте
Функция ЗапуститьФоновыеВыполнениеОпераций(ВыполняемыеОперации, ТекРайон = Неопределено)
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	МассивРайнов	= ПолучитьМассивРайонов();
	
	ПараметрыОтборов = Новый Структура;
	ПараметрыОтборов.Вставить("Организация",			 	Организация);
	ПараметрыОтборов.Вставить("ПериодНачисления",		 	ПериодНачисленияТекущий);
	ПараметрыОтборов.Вставить("ПериодНачисленияТекущий", 	ПериодНачисленияТекущий);
	ПараметрыОтборов.Вставить("ТекРайон",				 	Неопределено);
	ПараметрыОтборов.Вставить("Район",					 	МассивРайнов[0]);
	ПараметрыОтборов.Вставить("Абонент",					Неопределено);
	ПараметрыОтборов.Вставить("ОтборПоДому",			 	ОтборПоДому);
	ПараметрыОтборов.Вставить("ИсключаяОтдельностоящие", 	ИсключаяОтдельностоящие);
	ПараметрыОтборов.Вставить("СбрасыватьСостояниеПоследовательности", СбрасыватьСостояниеПоследовательности);
	ПараметрыОтборов.Вставить("Договор", 					Договор);
	ПараметрыОтборов.Вставить("АдресРезультата", 			АдресРезультата);
	ПараметрыОтборов.Вставить("Дом", 						Дом);
	ПараметрыОтборов.Вставить("СписокМКД", 					Неопределено);
	ПараметрыОтборов.Вставить("СбрасыватьВзаиморасчеты",	СбрасыватьВзаиморасчеты);
	ПараметрыОтборов.Вставить("СбрасыватьПоказания",		СбрасыватьПоказания);
	ПараметрыОтборов.Вставить("МассивКлючейПомещений",		Неопределено);
	ПараметрыОтборов.Вставить("МассивАбонентов",			Неопределено);
	ПараметрыОтборов.Вставить("ФинальноеНачисление",		Ложь);
	
	МассивРайнов.Удалить(0);
	//Если ОтборПоДому Тогда 
	//	ПараметрыОтборов.Вставить("Дом", Дом);
	//КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеКлиент(ПараметрыОтборов, ВыполняемыеОперации, МассивРайнов);
	
		
КонецФункции

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеКлиент(ПараметрыОтборов, ВыполняемыеОперации, МассивРайнов)
	
	ПредставлениеОперации = "Выполнение операций начислений по району " + ПараметрыОтборов.Район + " за " + Формат(ПериодНачисления, "ДФ='ММММ гггг'");	
	Если ОтборПоДому тогда
		ПредставлениеОперации = ПредставлениеОперации + " отбор по дому: " + ?(ЗначениеЗаполнено(ПараметрыОтборов.Дом), ПараметрыОтборов.Дом, "Частный сектор");
	КонецЕсли;
	
	ПредставлениеОперации	= ПредставлениеОперации + " (" + ПользователиКлиент.ТекущийПользователь() + ")";
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(ПараметрыОтборов, ВыполняемыеОперации, ИменаМодулей, ПредставлениеОперации);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	ДополнительныеПараметры = Новый Структура("АдресРезультата,МассивРайнов,ВыполняемыеОперации,ПараметрыОтбора", ПараметрыОтборов.АдресРезультата, МассивРайнов, ВыполняемыеОперации, ПараметрыОтборов);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗадания", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

КонецФункции


&НаКлиенте
Функция ПолучитьМассивРайонов()
	
	МассивРайонов = Новый Массив;
	
	МассивРайонов.Добавить(Район);

	Возврат МассивРайонов;

КонецФункции


&НаСервереБезКонтекста
Функция ЗапуститьФоновоеЗаданиеСервер(ПараметрыОтборов, ВыполняемыеОперации, ИменаМодулей, ПредставлениеОперации)
	
	ИмяМетода = "энргВыполнениеНачислений.энргВыполнитьНачисления";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();	
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = ПредставлениеОперации;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ПараметрыОтборов,
		ВыполняемыеОперации,
		ИменаМодулей);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗадания(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	УстановитьДоступностьЭлементовФормы(Истина);
	
	ДанныеВХ = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.АдресРезультата);
	УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресРезультата);
	
	Если ДанныеВХ = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Для Каждого СтрокаРезультата из ДанныеВХ Цикл
		
		ЭлементКартинка = Элементы["Статус" + СтрокаРезультата.ЭлементОшибок];		
		ЭлементОшибок 	= Элементы["Ошибки" + СтрокаРезультата.ЭлементОшибок];
		
		Если НЕ СтрокаРезультата.ЕстьОшибки Тогда
			
			ЭлементКартинка.Картинка  	= БиблиотекаКартинок.Успешно32;
			ЭлементОшибок.Заголовок 	= "Нет Ошибок";
			ЭлементОшибок.Доступность 	= Ложь;
			
		Иначе 
			
			ЭлементОшибок.Заголовок 	= "Есть ошибки";
			ЭлементКартинка.Картинка  	= БиблиотекаКартинок.Ошибка32;
			ЭлементОшибок.Доступность 	= Истина;			
			СтруктураОшибок.Вставить(СтрокаРезультата.ЭлементОшибок, СтрокаРезультата.ОписаниеОшибки);
			
		КонецЕсли;
		
	КонецЦикла; 	
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	ЧислоРайонов = ДополнительныеПараметры.МассивРайнов.Количество();
	Если ЧислоРайонов = 0 Тогда
		ПоказатьПредупреждение( , "Задание завершено.");
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры.ПараметрыОтбора.Район = ДополнительныеПараметры.МассивРайнов[0];
	ДополнительныеПараметры.МассивРайнов.Удалить(0);
	ЗапуститьФоновоеЗаданиеКлиент(ДополнительныеПараметры.ПараметрыОтбора, ДополнительныеПараметры.ВыполняемыеОперации, ДополнительныеПараметры.МассивРайнов);
	

КонецПроцедуры


#КонецОбласти


#КонецОбласти
